In [137]:
import boto3
import pandas as pd
from io import StringIO

In [138]:
# Import dataset
s3_client = boto3.client('s3')

# Load data
# Applicant details
response_1 = s3_client.get_object(Bucket='data-504-final-project-v2', Key='Cleaned/cleaned_applicants_details.csv')
content_1 = response_1['Body'].read().decode('utf-8')
applicants = pd.read_csv(StringIO(content_1))

# Sparta day
response_2 = s3_client.get_object(Bucket='data-504-final-project-v2', Key='Cleaned/combined_sparta_day_test_score.csv')
content_2 = response_2['Body'].read().decode('utf-8')
sparta_day = pd.read_csv(StringIO(content_2))

# Decision scores
response_3 = s3_client.get_object(Bucket='data-504-final-project-v2', Key='Cleaned/cleaned_talent_decision_scores.csv')
content_3 = response_3['Body'].read().decode('utf-8')
decision_scores = pd.read_csv(StringIO(content_3))


# Academy: Business
response_4 = s3_client.get_object(Bucket='data-504-final-project-v2', Key='Academy_Combined/Business_combined.csv')
content_4 = response_4['Body'].read().decode('utf-8')
business = pd.read_csv(StringIO(content_4))

# Academy: Data
# Academy: Business
response_5 = s3_client.get_object(Bucket='data-504-final-project-v2', Key='Academy_Combined/Data_combined.csv')
content_5 = response_5['Body'].read().decode('utf-8')
data = pd.read_csv(StringIO(content_5))

# Academy: Engineering 
# Academy: Business
response_6 = s3_client.get_object(Bucket='data-504-final-project-v2', Key='Academy_Combined/Engineering_combined.csv')
content_6 = response_6['Body'].read().decode('utf-8')
engineering = pd.read_csv(StringIO(content_6))

In [139]:
applicants.head()

,id,name,gender,dob,email,city,address,postcode,phone_number,uni,degree,invited_date,invited_by
0,1,Esme Trusslove,Female,1994-08-04,etrusslove0@google.es,Swindon,22056 Lerdahl Avenue,SN1,4.429578e+11,"Saint George's Hospital Medical School, Univer...",2:1,2019-04-10,Bruno Bellbrook
1,2,Matthaeus Audas,Male,NaN,maudas1@mapquest.com,Charlton,263 Nelson Trail,OX12,4.495773e+11,Keele University,2:1,2019-04-30,Doris Bellasis
2,3,Cherey Tollfree,Female,1992-12-08,ctollfree2@netvibes.com,Weston,69 Coleman Court,GU32,4.458875e+11,"King's College London, University of London",2:1,2019-04-25,Gismo Tilling
3,4,Eryn Speers,Female,NaN,espeers3@shinystat.com,Sutton,0166 Daystar Drive,CT15,4.414879e+11,University of Edinburgh,2:1,NaN,NaN
4,5,Theadora Berkelay,Female,1995-11-03,tberkelay4@godaddy.com,Upton,6 Mandrake Crossing,WF9,4.484147e+11,University of Leicester,2:1,2019-04-02,Stacey Broad

In [140]:
sparta_day.head() # drop first column

,date,academy,psychometrics,presentation,candidate_first_name,candidate_last_name
0,2019-08-01,Birmingham Academy,51,19,Hilary,Willmore
1,2019-08-01,Birmingham Academy,51,19,Orly,Lorens
2,2019-08-01,Birmingham Academy,55,16,Alvie,Bleackly
3,2019-08-01,Birmingham Academy,59,21,Deck,Itzchaki
4,2019-08-01,Birmingham Academy,66,25,Wilt,Penritt

In [141]:
decision_scores.head()

,date,strengths,weaknesses,self_development,geo_flex,financial_support_self,result,course_interest,tech_self_score_csharp,tech_self_score_java,tech_self_score_r,tech_self_score_javascript,tech_self_score_python,tech_self_score_c++,tech_self_score_ruby,tech_self_score_spss,tech_self_score_php,candidate_first_name,candidate_last_name
0,2019-08-22,Charisma,"Distracted, Impulsive, Introverted",True,True,True,Pass,Business,6.0,5.0,2.0,2.0,NaN,NaN,NaN,NaN,NaN,Stillmann,Castano
1,2019-08-01,"Patient, Curious, Problem Solving","Overbearing, Chatty, Indifferent",False,True,True,Fail,Data,4.0,2.0,NaN,NaN,1.0,4.0,NaN,NaN,NaN,Hilary,Willmore
2,2019-08-22,"Courteous, Independent, Patient","Introverted, Impulsive, Anxious",True,True,True,Pass,Business,NaN,NaN,NaN,NaN,NaN,4.0,4.0,NaN,NaN,Efrem,Whipple
3,2019-08-28,Passionate,"Perfectionist, Sensitive",True,True,True,Pass,Data,NaN,3.0,NaN,NaN,NaN,NaN,NaN,4.0,NaN,Sydel,Fenne
4,2019-08-07,Versatile,"Controlling, Perfectionist, Chatty",True,True,True,Pass,Engineering,NaN,4.0,2.0,NaN,3.0,3.0,1.0,NaN,2.0,Michel,Lebarree

#### Dataframes - size

In [142]:
len(applicants)

4691

In [143]:
len(sparta_day)

4134

In [144]:
len(decision_scores)

989

In [145]:
len(business)+len(data)+len(engineering)

397

In [146]:
business.head()

,name,trainer,course,cohort_number,start_date,Analytic_W1,Independent_W1,Determined_W1,Professional_W1,Studious_W1,...,Determined_W9,Professional_W9,Studious_W9,Imaginative_W9,Analytic_W10,Independent_W10,Determined_W10,Professional_W10,Studious_W10,Imaginative_W10
0,Quintus Penella,Gregor Gomez,Business,20,2019-02-11,1,2,2,1,2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Simon Murrey,Gregor Gomez,Business,20,2019-02-11,6,1,1,2,4,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Gustaf Lude,Gregor Gomez,Business,20,2019-02-11,6,4,1,1,2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Yolanda Fosse,Gregor Gomez,Business,20,2019-02-11,2,1,2,3,3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Lynnett Swin,Gregor Gomez,Business,20,2019-02-11,2,2,4,5,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [147]:
data.head()

,name,trainer,course,cohort_number,start_date,Analytic_W1,Independent_W1,Determined_W1,Professional_W1,Studious_W1,...,Determined_W9,Professional_W9,Studious_W9,Imaginative_W9,Analytic_W10,Independent_W10,Determined_W10,Professional_W10,Studious_W10,Imaginative_W10
0,Pyotr De Zuani,Trixie Orange,Data,28,2019-02-18,1,3,4,2,2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Vince Scott,Trixie Orange,Data,28,2019-02-18,1,1,4,3,3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Kellie Althorp,Trixie Orange,Data,28,2019-02-18,3,4,1,1,5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Aida Bothams,Trixie Orange,Data,28,2019-02-18,4,2,2,3,3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Nettie Civitillo,Trixie Orange,Data,28,2019-02-18,5,4,3,1,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [148]:
engineering.head()

,name,trainer,course,cohort_number,start_date,Analytic_W1,Independent_W1,Determined_W1,Professional_W1,Studious_W1,...,Determined_W9,Professional_W9,Studious_W9,Imaginative_W9,Analytic_W10,Independent_W10,Determined_W10,Professional_W10,Studious_W10,Imaginative_W10
0,Sigrid Veitch,Eshal Brandt,Engineering,17,2019-02-18,4,4,3,6,2,...,6.0,8.0,7.0,8.0,8.0,8.0,8.0,8.0,7.0,8.0
1,Rodrick Henworth,Eshal Brandt,Engineering,17,2019-02-18,4,4,3,3,1,...,8.0,7.0,8.0,5.0,8.0,8.0,8.0,8.0,8.0,8.0
2,Reggie Lawlor,Eshal Brandt,Engineering,17,2019-02-18,5,2,5,3,3,...,8.0,8.0,8.0,8.0,8.0,8.0,8.0,8.0,8.0,8.0
3,Thornton Thuillier,Eshal Brandt,Engineering,17,2019-02-18,3,5,4,5,2,...,7.0,7.0,8.0,8.0,8.0,8.0,8.0,8.0,7.0,8.0
4,Thomasine Poundford,Eshal Brandt,Engineering,17,2019-02-18,3,2,4,1,2,...,8.0,5.0,8.0,8.0,8.0,8.0,8.0,8.0,8.0,8.0

In [149]:
# Combine all academy names
academy = pd.concat([business[['name']], data[['name']], engineering[['name']]], ignore_index=True)

# Check 
len(academy) == len(business)+len(data)+len(engineering)

True

In [150]:
# Clean name fields for matching
applicants['name_clean'] = applicants['name'].str.strip().str.lower()
academy['name_clean'] = academy['name'].str.strip().str.lower()

In [151]:
# Merge academy students with applicant info
merged = academy.merge(applicants, on='name_clean', how='left')

In [152]:
merged.head()

,name_x,name_clean,id,name_y,gender,dob,email,city,address,postcode,phone_number,uni,degree,invited_date,invited_by
0,Quintus Penella,quintus penella,1769,Quintus Penella,Male,1992-11-11,qpenella7r@tripod.com,Whitchurch,8132 Grover Hill,BS14,4.414412e+11,NaN,NaN,2019-01-15,Bruno Bellbrook
1,Simon Murrey,simon murrey,1696,Simon Murrey,Male,1999-04-01,smurrey5q@pen.io,London,516 American Ash Drive,WC2H,NaN,University of Portsmouth,2:1,2019-01-16,Rupert Ripple
2,Gustaf Lude,gustaf lude,1663,Gustaf Lude,Male,1991-04-25,glude4t@harvard.edu,Newtown,392 Florence Pass,RG20,NaN,University of Bradford,3,2019-01-16,Rupert Ripple
3,Yolanda Fosse,yolanda fosse,1573,Yolanda Fosse,Female,1999-11-15,yfosse2b@over-blog.com,London,9683 Jenifer Street,EC1V,4.453733e+11,University of Wales,1,2019-01-16,Bruno Belbrook
4,Lynnett Swin,lynnett swin,1661,Lynnett Swin,Female,1996-12-29,lswin4r@icq.com,Carlton,0 Bellgrove Court,DL8,4.412476e+11,University of Greenwich,2:2,2019-01-16,Gismo Tilling

In [153]:
merged.isnull().sum()

name_x           0
name_clean       0
id               0
name_y           0
gender           8
dob             27
email           17
city             4
address          4
postcode         4
phone_number    33
uni             13
degree          13
invited_date    39
invited_by       0
dtype: int64

In [154]:
merged.dtypes

name_x           object
name_clean       object
id                int64
name_y           object
gender           object
dob              object
email            object
city             object
address          object
postcode         object
phone_number    float64
uni              object
degree           object
invited_date     object
invited_by       object
dtype: object

### Critical info

In [155]:
required_cols = ['dob', 'email', 'city', 'address', 'postcode', 'phone_number']

In [156]:
# Critical info
for col in required_cols:
    if applicants[col].dtype == 'object':
        applicants[col] = applicants[col].fillna('Required')
        merged[col] = merged[col].fillna('Required')
    else:
        applicants[col] = applicants[col].fillna(-1)
        merged[col] = merged[col].fillna(-1)

### Not essential: `invited_date`

In [157]:
# Invited date: label as 'not essential' 
applicants['invited_date'] = applicants['invited_date'].fillna('Not essential')
merged['invited_date'] = merged['invited_date'].fillna('Not essential')

### Gender, University, Degree

In [158]:
# Investigate university & gender
print("Gender categories:")
print(applicants['gender'].unique())

#print("\nUniversity categories:")
#print(applicants['uni'].unique())

print("\nDegree categories:")
print(applicants['degree'].unique())

Gender categories:
['Female' 'Male' nan]

Degree categories:
['2:1' '1' '3' nan '2:2']

In [162]:
# For gender: missing values -> 'Other/Missing'
applicants['gender'] = applicants['gender'].fillna('Other/Missing')
merged['gender'] = merged['gender'].fillna('Other/Missing')


# For uni & degree: most likely didn't attend -> 'Didn't attend/Missing'
applicants['uni'] = applicants['uni'].fillna("Didn't attend/Missing")
merged['uni'] = merged['uni'].fillna("Didn't attend/Missing")

applicants['degree'] = applicants['degree'].fillna("Didn't attend/Missing")
merged['degree'] = merged['uni'].fillna("Didn't attend/Missing")


# Could just do 'clarify' for both

In [163]:
# Check 
print("Gender categories:")
print(applicants['gender'].unique())

#print("\nUniversity categories:")
#print(applicants['uni'].unique())

print("\nDegree categories:")
print(applicants['degree'].unique())

Gender categories:
['Female' 'Male' 'Other/Missing']

Degree categories:
['2:1' '1' '3' "Didn't attend/Missing" '2:2']

### Checks

In [164]:
merged.isnull().sum()

name_x          0
name_clean      0
id              0
name_y          0
gender          0
dob             0
email           0
city            0
address         0
postcode        0
phone_number    0
uni             0
degree          0
invited_date    0
invited_by      0
dtype: int64

In [165]:
merged.dtypes

name_x           object
name_clean       object
id                int64
name_y           object
gender           object
dob              object
email            object
city             object
address          object
postcode         object
phone_number    float64
uni              object
degree           object
invited_date     object
invited_by       object
dtype: object

### Relabel the rest of applicant missing info as 'Not required'

In [167]:
applicants.isnull().sum()

id                0
name              0
gender            0
dob               0
email             0
city              0
address           0
postcode          0
phone_number      0
uni               0
degree            0
invited_date      0
invited_by      557
name_clean        0
dtype: int64

In [ ]:
for col in applicants.columns:
    if applicants[col].dtype == 'object':
        applicants[col] = applicants[col].fillna('Not required')
    else:
        # keep numeric columns as is (NaN will stay)
        pass